jimmywong2003/nrf52840-dongle-example/ble_app_blinky_cli_usb_log/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_scan_response_data,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

        }
};

#if NRF_LOG_BACKEND_FLASHLOG_ENABLED
NRF_LOG_BACKEND_FLASHLOG_DEF(m_flash_log_backend);
#endif

#if NRF_LOG_BACKEND_CRASHLOG_ENABLED
NRF_LOG_BACKEND_CRASHLOG_DEF(m_crash_log_backend);
#endif

/* Counter timer. */
APP_TIMER_DEF(m_timer_0);

/* Declared in demo_cli.c */
extern uint32_t m_counter;
extern bool m_counter_active;

#if CLI_OVER_USB_CDC_ACM

/**
 * @brief Enable power USB detection
 *
 * Configure if example supports USB port connection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif


static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
        switch (event)
        {
        case APP_USBD_EVT_STOPPED:
                app_usbd_disable();
                break;
        case APP_USBD_EVT_POWER_DETECTED:
                if (!nrf_drv_usbd_is_enabled())
                {
                        app_usbd_enable();
                }
                break;
        case APP_USBD_EVT_POWER_REMOVED:
                app_usbd_stop();
                break;
        case APP_USBD_EVT_POWER_READY:
                app_usbd_start();
                break;
        default:
                break;
        }
}

#endif //CLI_OVER_USB_CDC_ACM


/**
 * @brief Command line interface instance
 * */
#define CLI_EXAMPLE_LOG_QUEUE_SIZE  (16)//4)

#if CLI_OVER_USB_CDC_ACM
NRF_CLI_CDC_ACM_DEF(m_cli_cdc_acm_transport);
NRF_CLI_DEF(m_cli_cdc_acm,
            "usb_cli:~$ ",
            &m_cli_cdc_acm_transport.transport,
            '\r',
            CLI_EXAMPLE_LOG_QUEUE_SIZE);
#endif //CLI_OVER_USB_CDC_ACM

#if CLI_OVER_UART
NRF_CLI_UART_DEF(m_cli_uart_transport, 0, 64, 16);
NRF_CLI_DEF(m_cli_uart,
            "uart_cli:~$ ",
            &m_cli_uart_transport.transport,
            '\r',
            CLI_EXAMPLE_LOG_QUEUE_SIZE);
#endif

NRF_CLI_RTT_DEF(m_cli_rtt_transport);
NRF_CLI_DEF(m_cli_rtt,
            "rtt_cli:~$ ",
            &m_cli_rtt_transport.transport,
            '\n',
            CLI_EXAMPLE_LOG_QUEUE_SIZE);


//
//static void CDC_ACM_1_user_ev_handler(app_usbd_class_inst_t const * p_inst,
//                                    app_usbd_cdc_acm_user_event_t event);
//
//#define READ_SIZE 1
//
//static char m_rx_buffer[READ_SIZE];
//static char m_tx_buffer[NRF_DRV_USBD_EPSIZE];
//static bool m_send_flag = 0;
//
//#define CDC_ACM_1_COMM_INTERFACE  2//0
//#define CDC_ACM_1_COMM_EPIN       NRF_DRV_USBD_EPIN4//NRF_DRV_USBD_EPIN2
//
//#define CDC_ACM_1_DATA_INTERFACE  3//1
//#define CDC_ACM_1_DATA_EPIN       NRF_DRV_USBD_EPIN3//NRF_DRV_USBD_EPIN1
//#define CDC_ACM_1_DATA_EPOUT      NRF_DRV_USBD_EPOUT2//NRF_DRV_USBD_EPOUT1
//
//
///**
// * @brief CDC_ACM class instance
// * */
//APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm_1,
//                            CDC_ACM_1_user_ev_handler,
//                            CDC_ACM_1_COMM_INTERFACE,
//                            CDC_ACM_1_DATA_INTERFACE,
//                            CDC_ACM_1_COMM_EPIN,
//                            CDC_ACM_1_DATA_EPIN,
//                            CDC_ACM_1_DATA_EPOUT,
//                            APP_USBD_CDC_COMM_PROTOCOL_AT_V250
//);
//
///**
// * @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t (headphones)
// * */
//static void CDC_ACM_1_user_ev_handler(app_usbd_class_inst_t const * p_inst,
//                                    app_usbd_cdc_acm_user_event_t event)
//{
//    app_usbd_cdc_acm_t const * p_cdc_acm = app_usbd_cdc_acm_class_get(p_inst);
//
//    switch (event)
//    {
//        case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN:
//        {
//
//            /*Setup first transfer*/
//            ret_code_t ret = app_usbd_cdc_acm_read(&m_app_cdc_acm_1,
//                                                   m_rx_buffer,
//                                                   READ_SIZE);
//            UNUSED_VARIABLE(ret);
//            break;
//        }
//        case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
//            break;
//        case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
//            break;
//        case APP_USBD_CDC_ACM_USER_EVT_RX_DONE:
//        {
//            ret_code_t ret;
//            NRF_LOG_INFO("Bytes waiting: %d", app_usbd_cdc_acm_bytes_stored(p_cdc_acm));
//            do
//            {
//                /*Get amount of data transfered*/
//                size_t size = app_usbd_cdc_acm_rx_size(p_cdc_acm);
//                NRF_LOG_INFO("RX: size: %lu char: %c", size, m_rx_buffer[0]);
//
//                /* Fetch data until internal buffer is empty */
//                ret = app_usbd_cdc_acm_read(&m_app_cdc_acm_1,
//                                            m_rx_buffer,
//                                            READ_SIZE);
//            } while (ret == NRF_SUCCESS);
//
//            break;
//        }
//        default:
//            break;
//    }
//}

static void timer_handle(void * p_context)
{
        UNUSED_PARAMETER(p_context);

        if (m_counter_active)
        {
                m_counter++;
                NRF_LOG_RAW_INFO("counter = %d\n", m_counter);
        }
}

static void cli_start(void)
{
        ret_code_t ret;

