jimmywong2003/nrf52840-dongle-example/ble_app_blinky_cli_usb_log/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
                NRF_LOG_DEBUG("PHY update request.");
                ble_gap_phys_t const phys =
                {
                        .rx_phys = BLE_GAP_PHY_AUTO,
                        .tx_phys = BLE_GAP_PHY_AUTO,
                };
                err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
                APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
                // No system attributes have been stored.
                err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                NRF_LOG_DEBUG("GATT Client Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                NRF_LOG_DEBUG("GATT Server Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        default:
                // No implementation needed.
                break;
        }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;

        switch (pin_no)
        {
        case LEDBUTTON_BUTTON:
                NRF_LOG_INFO("Send button state change.");
                err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE &&
                    err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                {
                        APP_ERROR_CHECK(err_code);
                }
                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        //if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}

void idle_task(void * p_context)
{

        advertising_start();

        // Enter main loop.
        for (;;)
        {
                if (NRF_LOG_PROCESS() == false)
                {
                        nrf_pwr_mgmt_run();
                }
                task_yield();
        }
}

/**@brief Function for application main entry.
 */
int main(void)
{

        ret_code_t ret;

        if (USE_CYCCNT_TIMESTAMP_FOR_LOG)
        {
                CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
                DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
                DWT->CYCCNT = 0;
                APP_ERROR_CHECK(NRF_LOG_INIT(cyccnt_get, 64000000));
        }
        else
        {
                APP_ERROR_CHECK(NRF_LOG_INIT(app_timer_cnt_get));
        }

        ret = nrf_drv_clock_init();
        APP_ERROR_CHECK(ret);
        nrf_drv_clock_lfclk_request(NULL);

        // Initialize.
        //log_init();
        leds_init();
        timers_init();

        ret = app_timer_create(&m_timer_0, APP_TIMER_MODE_REPEATED, timer_handle);
        APP_ERROR_CHECK(ret);

        ret = app_timer_start(m_timer_0, APP_TIMER_TICKS(1000), NULL);
        APP_ERROR_CHECK(ret);

        stack_guard_init();

        cli_init();
        usbd_init();

        nrf_delay_ms(1000);
        log_init();

        usbd_enable();


        nrf_delay_ms(3000);

        buttons_init();
        power_management_init();
        ble_stack_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        ret = fds_init();
        APP_ERROR_CHECK(ret);

        UNUSED_RETURN_VALUE(nrf_log_config_load());

        //APP_ERROR_CHECK(nrf_cli_task_create(&m_cli));
        APP_ERROR_CHECK(nrf_cli_task_create(&m_cli_rtt));


//        APP_ERROR_CHECK(nrf_cli_task_create(&m_cli_uart));
        APP_ERROR_CHECK(nrf_cli_task_create(&m_cli_cdc_acm));

        //cli_start();

        flashlog_init();

        NRF_LOG_RAW_INFO("Command Line Interface example started.\n");
        NRF_LOG_RAW_INFO("Please press the Tab key to see all available commands.\n");

        NRF_LOG_INFO("Blinky example started.");
        task_manager_start(idle_task, NULL);

}


/**
 * @}
 */
